## [DataFrame 인덱스 다루기]

- (1) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 설정

- (1) 모듈 로딩<hr>

In [89]:
import pandas as pd

- (2) 데이터 준비<hr>

In [90]:
# dict 타입의 데이터 생성
exam={'이름':['김','이','박','조'],
       '국어': [90,60,40,39],
       '수학': [60,30,40,20],
       '사회': [80,35,49,97],
       '과학': [80,60,30,65]
     }

- (3) 데이터 저장

In [91]:
examDF=pd.DataFrame(exam)

- (4) 데이터 확인

In [92]:
examDF

  이름  국어  수학  사회  과학
0  김  90  60  80  80
1  이  60  30  35  60
2  박  40  40  49  30
3  조  39  20  97  65

In [93]:
# zero 98 50 60 70
examDF.loc[4] = ['김',90,70,60,70]

In [94]:
# zero 98 89 50 40
examDF.loc[5] = ['김',90,40,54,56]

- (5) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 일부 변경 DF.rename()

In [95]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False!!
examDF.rename(index={0:'zero'}, inplace=True)

- 행 데이터 추가

In [96]:
examDF

     이름  국어  수학  사회  과학
zero  김  90  60  80  80
1     이  60  30  35  60
2     박  40  40  49  30
3     조  39  20  97  65
4     김  90  70  60  70
5     김  90  40  54  56

In [97]:
# 열 이름 인덱스 일부 변경 => column={기존인덱스:새로운인덱스}
examDF.rename(columns={'과학':'영어'}, inplace=True)

In [98]:
examDF.columns

Index(['이름', '국어', '수학', '사회', '영어'], dtype='object')

- (5) 새로운 인덱스 설정 - 방법2: 특정 컬럼 => 인덱스 : DF.set_index()

In [99]:
# 현재 기본 0 ~ ==> 이름 컬럼 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3, 4, 5], dtype='object')

In [100]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라미터가 False로 원본 적용 안됨!
examDF2=examDF.set_index('이름')
examDF2.index

Index(['김', '이', '박', '조', '김', '김'], dtype='object', name='이름')

In [101]:
examDF2.loc['김']

    국어  수학  사회  영어
이름
김   90  60  80  80
김   90  70  60  70
김   90  40  54  56

In [102]:
# 2개의 컬럼을 행 인덱스 설정 단, inplace 파라미터가 False로 원본에 적용 안됨!
examDF3=examDF.set_index(['이름', '국어', '수학'])
examDF3.index

MultiIndex([('김', 90, 60),
            ('이', 60, 30),
            ('박', 40, 40),
            ('조', 39, 20),
            ('김', 90, 70),
            ('김', 90, 40)],
           names=['이름', '국어', '수학'])

In [103]:
examDF3

          사회  영어
이름 국어 수학
김  90 60  80  80
이  60 30  35  60
박  40 40  49  30
조  39 20  97  65
김  90 70  60  70
      40  54  56

In [104]:
examDF3.loc[('김', 90, 60)]

사회    80
영어    80
Name: (김, 90, 60), dtype: int64

In [105]:
examDF3.loc[('김')]

       사회  영어
국어 수학
90 60  80  80
   70  60  70
   40  54  56

In [106]:
examDF3.loc[('김', 90)]

C:\Users\KDP-30\AppData\Local\Temp\ipykernel_11848\753133733.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF3.loc[('김', 90)]

    사회  영어
수학
60  80  80
70  60  70
40  54  56

In [107]:
# KeyError => '김',90,80 형식으로 90으로 시작하는 키 없음(중간부터 시작 못함)
#examDF3.loc[(90, 80)]

- (5) 새로운 인덱스 설정 - 방법3: 멀티인덱스 제어 DF.set_index([컬럼1, 컬럼2 ,,, 컬럼n])

In [113]:
# 이름, 국어, 수학을 인덱스 설정
examDF1=examDF.set_index(['이름', '국어', '수학'])
examDF1

          사회  영어
이름 국어 수학
김  90 60  80  80
이  60 30  35  60
박  40 40  49  30
조  39 20  97  65
김  90 70  60  70
      40  54  56

In [114]:
examDF1.index

MultiIndex([('김', 90, 60),
            ('이', 60, 30),
            ('박', 40, 40),
            ('조', 39, 20),
            ('김', 90, 70),
            ('김', 90, 40)],
           names=['이름', '국어', '수학'])

- 행 데이터 선택 : DF객체변수명.loc[행레이블] / DF객체변수명.iloc[위치인덱스]

In [115]:
examDF1.loc[('김',90,60)]

사회    80
영어    80
Name: (김, 90, 60), dtype: int64

In [116]:
examDF1.loc[('김',90,70)]

사회    60
영어    70
Name: (김, 90, 70), dtype: int64

In [117]:
examDF1.loc[('김',90,40)]

사회    54
영어    56
Name: (김, 90, 40), dtype: int64

In [119]:
# Keyerror 발생 ==> ('김', 90, 40)
#examDF1.loc[(90)]

- 멀티인덱스의 인덱스의 일부분을 기준으로 행 선택 : xs()
    * 예) '김' 90 60 => Level 0  1  2

In [121]:
examDF1.xs('김', level=0)

       사회  영어
국어 수학
90 60  80  80
   70  60  70
   40  54  56

In [123]:
examDF1.xs(90, level=1)

       사회  영어
이름 수학
김  60  80  80
   70  60  70
   40  54  56

In [125]:
examDF1.xs(70, level=2)

       사회  영어
이름 국어
김  90  60  70

- ('김', 90, 70),('이', 60, 30)2개 행을 한꺼번에 가져오기

In [127]:
examDF1.loc[[('김', 90, 70), ('이', 60, 30)]]

          사회  영어
이름 국어 수학
김  90 70  60  70
이  60 30  35  60

In [130]:
examDF1.loc[[('김', 90, 70)]]

          사회  영어
이름 국어 수학
김  90 70  60  70

In [110]:
# 현재 행 인덱스 ==> 컬럼으로 추가
examDF.reset_index()

  index 이름  국어  수학  사회  영어
0  zero  김  90  60  80  80
1     1  이  60  30  35  60
2     2  박  40  40  49  30
3     3  조  39  20  97  65
4     4  김  90  70  60  70
5     5  김  90  40  54  56

In [111]:
examDF

     이름  국어  수학  사회  영어
zero  김  90  60  80  80
1     이  60  30  35  60
2     박  40  40  49  30
3     조  39  20  97  65
4     김  90  70  60  70
5     김  90  40  54  56

In [112]:
# 현재 행 인덱스를 컬럼에 추가 하지 않고 삭제 => drop 파라미터를 True로 설정
df2=examDF.reset_index(drop=True)
df2

  이름  국어  수학  사회  영어
0  김  90  60  80  80
1  이  60  30  35  60
2  박  40  40  49  30
3  조  39  20  97  65
4  김  90  70  60  70
5  김  90  40  54  56

- (5) 인덱스 재배치 = 행/열 인덱스를 원하는 순서대로 재배치 + 존재하지 않는 행/열 추가
    * DF.reindex()

In [132]:
print(examDF.index, examDF.columns, sep='\n\n')

Index(['zero', 1, 2, 3, 4, 5], dtype='object')

Index(['이름', '국어', '수학', '사회', '영어'], dtype='object')

- 컬럼명 순서 변경 ==> '영어','수학','국어','사회','총합'

In [136]:
examDF.reindex(['영어','수학','국어','사회', '총합'], axis='columns', fill_value=0)

      영어  수학  국어  사회  총합
zero  80  60  90  80   0
1     60  30  60  35   0
2     30  40  40  49   0
3     65  20  39  97   0
4     70  70  90  60   0
5     56  40  90  54   0

In [135]:
examDF

     이름  국어  수학  사회  영어
zero  김  90  60  80  80
1     이  60  30  35  60
2     박  40  40  49  30
3     조  39  20  97  65
4     김  90  70  60  70
5     김  90  40  54  56

- 행 인데스 재배치:0,2,4,1,5

In [137]:
examDF.reindex(['zero',2,4,1,3,5], axis='index', fill_value=0)

     이름  국어  수학  사회  영어
zero  김  90  60  80  80
2     박  40  40  49  30
4     김  90  70  60  70
1     이  60  30  35  60
3     조  39  20  97  65
5     김  90  40  54  56

- 컬럼명 순서 변경 ==> '영어','수학','국어','사회','총합'+행인덱스 => 0,2,4,1,3,5 재배치

In [140]:
examDF.reindex(index=['zero',2,4,1,3,5], columns=['영어','수학','국어','사회', '총합'], fill_value=0)

      영어  수학  국어  사회  총합
zero  80  60  90  80   0
2     30  40  40  49   0
4     70  70  90  60   0
1     60  30  60  35   0
3     65  20  39  97   0
5     56  40  90  54   0